---
kind: type
id: T:Autodesk.Revit.UI.ColorSelectionDialog
source: html/3c1ae512-f679-12ec-7b15-7b402ea6db3d.htm
---
# Autodesk.Revit.UI.ColorSelectionDialog

Allows display of the Revit Color dialog.

## Syntax (C#)
```csharp
public class ColorSelectionDialog : IDisposable
```

## Remarks
The class provides the option to launch the Revit Color dialog to select the color.